{"modelTopology":{"class_name":"Model","config":{"name":"model3","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,21,12,1],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"model2","class_name":"Model","config":{"name":"model2","layers":[{"name":"input92","class_name":"InputLayer","config":{"batch_input_shape":[null,21,12,1],"dtype":"float32","sparse":false,"name":"input92"},"inbound_nodes":[]},{"name":"conv2d_Conv2D1","class_name":"Conv2D","config":{"filters":8,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":false},"inbound_nodes":[[["input92",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU1","class_name":"LeakyReLU","config":{"alpha":0.01,"name":"leaky_re_lu_LeakyReLU1","trainable":false},"inbound_nodes":[[["conv2d_Conv2D1",0,0,{}]]]},{"name":"conv2d_Conv2D2","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,10],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D2","trainable":false},"inbound_nodes":[[["leaky_re_lu_LeakyReLU1",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU2","class_name":"LeakyReLU","config":{"alpha":0.01,"name":"leaky_re_lu_LeakyReLU2","trainable":false},"inbound_nodes":[[["conv2d_Conv2D2",0,0,{}]]]}],"input_layers":[["input92",0,0]],"output_layers":[["leaky_re_lu_LeakyReLU2",0,0]]},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"flatten_Flatten1","class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true},"inbound_nodes":[[["model2",1,0,{}]]]},{"name":"input3","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input3"},"inbound_nodes":[]},{"name":"concatenate_Concatenate2","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate2","trainable":true},"inbound_nodes":[[["flatten_Flatten1",0,0,{}],["input3",0,0,{}]]]},{"name":"score_dense1","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"score_dense1","trainable":true},"inbound_nodes":[[["concatenate_Concatenate2",0,0,{}]]]},{"name":"score_leaky1","class_name":"LeakyReLU","config":{"alpha":0.01,"name":"score_leaky1","trainable":true},"inbound_nodes":[[["score_dense1",0,0,{}]]]},{"name":"score_dense2","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"score_dense2","trainable":true},"inbound_nodes":[[["score_leaky1",0,0,{}]]]},{"name":"score_leaky2","class_name":"LeakyReLU","config":{"alpha":0.01,"name":"score_leaky2","trainable":true},"inbound_nodes":[[["score_dense2",0,0,{}]]]},{"name":"add_Add1","class_name":"Add","config":{"name":"add_Add1","trainable":true},"inbound_nodes":[[["score_leaky2",0,0,{}],["score_leaky1",0,0,{}]]]},{"name":"score_preoutput","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"score_preoutput","trainable":true},"inbound_nodes":[[["add_Add1",0,0,{}]]]},{"name":"input2","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input2"},"inbound_nodes":[]},{"name":"add_Add2","class_name":"Add","config":{"name":"add_Add2","trainable":true},"inbound_nodes":[[["score_preoutput",0,0,{}],["input2",0,0,{}]]]}],"input_layers":[["input1",0,0],["input2",0,0],["input3",0,0]],"output_layers":[["add_Add2",0,0]]},"keras_version":"tfjs-layers 4.21.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[5,3,1,8],"dtype":"float32"},{"name":"conv2d_Conv2D1/bias","shape":[8],"dtype":"float32"},{"name":"conv2d_Conv2D2/kernel","shape":[1,10,8,16],"dtype":"float32"},{"name":"conv2d_Conv2D2/bias","shape":[16],"dtype":"float32"},{"name":"score_dense1/kernel","shape":[273,16],"dtype":"float32"},{"name":"score_dense1/bias","shape":[16],"dtype":"float32"},{"name":"score_dense2/kernel","shape":[16,16],"dtype":"float32"},{"name":"score_dense2/bias","shape":[16],"dtype":"float32"},{"name":"score_preoutput/kernel","shape":[16,1],"dtype":"float32"},{"name":"score_preoutput/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.21.0","convertedBy":null}